all_open/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{

    door
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    window
    {
        type        pressureInletOutletVelocity;
        value       $internalField;
    }

    fan
    {
        // Fix only the normal component on outflow and all three components of velocity on inflow,
        // in order to be well-posed on outflow and also in case there are any faces with inflowing velocity.
        type                fixedNormalInletOutletVelocity;
        fixTangentialInflow yes;
        normalVelocity
        {
            type            fixedValue;
            value           uniform (0.0 1.1 0.0);
        }
        value               uniform (0.0 1.1 0.0);
    }

    constraint
    {
        type        symmetry;
        value       $internalField;
    }

    wall
    {
        // movingWallVelocity reduces to fixedValue if the mesh is not moving
        type        movingWallVelocity;
        value       uniform (0 0 0);
    }

    defaultFaces
    {
        type        slip;
        value       $internalField;
    }

}

// ************************************************************************* //
